{
  "terms_of_use": {
    "en": {
      "title": "Terms of Use",
      "effective_date": "3/07/2025",
      "sections": [
        {
          "title": "1. General",
          "content": "The App is intended for individuals preparing for the Commercial Driver’s License (CDL) exams in the United States. The App is provided as-is without any warranties or guarantees. You agree to use the App only for lawful purposes and in accordance with all applicable laws and regulations."
        },
        {
          "title": "2. Payments and Subscriptions",
          "content": "Certain features of the App are available only through a paid subscription. Subscription plans may be offered on a weekly, monthly, quarterly, semiannual, or annual basis. Payments are processed through Google Play or Apple App Store, depending on your device. Subscriptions renew automatically unless canceled at least 24 hours before the end of the current period. You can manage or cancel your subscription at any time through your app store account settings."
        },
        {
          "title": "3. Content Usage",
          "content": "All content within the App, including questions, translations, illustrations, and explanations, is for educational purposes only. You may not copy, reproduce, distribute, or sell any part of the App's content without prior written permission."
        },
        {
          "title": "4. Disclaimer",
          "content": "CDL Pro is provided for educational purposes only. We are not responsible for your exam outcome or inability to obtain a CDL permit. CDL Pro offers practice tests and study materials to help you prepare, but passing the exam ultimately depends on your individual effort and understanding of the material. Always verify information with official sources and consult your local DMV for the most up-to-date requirements. Use CDL Pro as a supplementary tool alongside proper training and official study guides."
        },
        {
          "title": "5. Privacy",
          "content": "Your privacy is important to us. Please refer to our Privacy Policy for details on how we collect, use, and protect your information."
        },
        {
          "title": "6. Modifications",
          "content": "We reserve the right to update or modify these Terms at any time. Continued use of the App after such changes means you accept the updated Terms."
        },
        {
          "title": "7. Contact",
          "content": "If you have any questions or concerns about these Terms, please contact us at: ulamuyaman@gmail.com"
        }
      ]
    },
    "ru": {
      "title": "Условия использования",
      "effective_date": "3/07/2025",
      "sections": [
        {
          "title": "1. Общее",
          "content": "Приложение предназначено для пользователей, готовящихся к экзамену на получение CDL в США. Приложение предоставляется «как есть» без каких-либо гарантий. Вы соглашаетесь использовать приложение только в законных целях и в соответствии с действующим законодательством."
        },
        {
          "title": "2. Платежи и подписки",
          "content": "Некоторые функции приложения доступны только по подписке. Подписки могут быть еженедельными, ежемесячными, квартальными, полугодовыми или годовыми. Платежи обрабатываются через Google Play или App Store в зависимости от вашего устройства. Подписка продлевается автоматически, если вы не отмените её как минимум за 24 часа до окончания текущего периода. Вы можете управлять подпиской или отменить её в настройках вашей учётной записи в магазине приложений."
        },
        {
          "title": "3. Использование контента",
          "content": "Весь контент в приложении, включая вопросы, переводы, иллюстрации и пояснения, предназначен исключительно для образовательных целей. Запрещено копировать, распространять или продавать материалы приложения без письменного разрешения."
        },
        {
          "title": "4. Отказ от ответственности",
          "content": "CDL Pro предоставляется только в образовательных целях. Мы не несем ответственности за результаты экзамена или невозможность получить разрешение CDL. CDL Pro предлагает практические тесты и учебные материалы, которые помогут вам подготовиться, но сдача экзамена в конечном итоге зависит от ваших индивидуальных усилий и понимания материала. Всегда проверяйте информацию в официальных источниках и консультируйтесь с местным DMV для получения самых последних требований. Используйте CDL Pro в качестве дополнительного инструмента наряду с надлежащим обучением и официальными учебными пособиями."
        },
        {
          "title": "5. Конфиденциальность",
          "content": "Ваша конфиденциальность важна для нас. См. Политику конфиденциальности, чтобы узнать, как мы собираем, используем и защищаем ваши данные."
        },
        {
          "title": "6. Изменения",
          "content": "Мы оставляем за собой право обновлять или изменять данные условия в любое время. Продолжая использовать приложение после таких изменений, вы соглашаетесь с обновлёнными условиями."
        },
        {
          "title": "7. Контакты",
          "content": "Если у вас есть вопросы по этим условиям, свяжитесь с нами: ulamuyaman@gmail.com"
        }
      ]
    },
    "uk": {
      "title": "Умови використання",
      "effective_date": "3/07/2025",
      "sections": [
        {
          "title": "1. Загальні положення",
          "content": "Додаток призначений для користувачів, які готуються до складання іспиту на отримання CDL у США. Додаток надається «як є» без будь-яких гарантій. Ви погоджуєтесь використовувати додаток лише в законних цілях та відповідно до чинного законодавства."
        },
        {
          "title": "2. Платежі та підписки",
          "content": "Деякі функції додатку доступні лише за передплатою. Плани передплати можуть бути щотижневими, щомісячними, квартальними, піврічними або річними. Оплата здійснюється через Google Play або Apple App Store залежно від вашого пристрою. Передплата автоматично поновлюється, якщо її не скасувати принаймні за 24 години до кінця поточного періоду. Ви можете керувати передплатою в налаштуваннях облікового запису."
        },
        {
          "title": "3. Використання контенту",
          "content": "Увесь контент додатку, включаючи запитання, переклади, ілюстрації та пояснення, надається виключно з освітньою метою. Заборонено копіювати, поширювати чи продавати контент без письмового дозволу."
        },
        {
          "title": "4. Відмова від відповідальності",
          "content": "CDL Pro надається лише для освітніх цілей. Ми не несемо відповідальності за ваш результат іспиту чи неможливість отримати дозвіл CDL. CDL Pro пропонує практичні тести та навчальні матеріали, які допоможуть вам підготуватися, але успішне складання іспиту зрештою залежить від ваших індивідуальних зусиль та розуміння матеріалу. Завжди перевіряйте інформацію в офіційних джерелах та звертайтеся до місцевого DMV, щоб дізнатися про найактуальніші вимоги. Використовуйте CDL Pro як додатковий інструмент поряд із належним навчанням та офіційними навчальними посібниками."
        },
        {
          "title": "5. Конфіденційність",
          "content": "Ваша конфіденційність важлива для нас. Ознайомтесь із нашою Політикою конфіденційності, щоб дізнатись, як ми збираємо та захищаємо ваші дані."
        },
        {
          "title": "6. Зміни до умов",
          "content": "Ми залишаємо за собою право змінювати ці умови в будь-який час. Продовжуючи використовувати додаток після змін, ви погоджуєтесь із оновленими умовами."
        },
        {
          "title": "7. Контакт",
          "content": "З питаннями звертайтесь на email: ulamuyaman@gmail.com"
        }
      ]
    },
    "es": {
      "title": "Términos de Uso",
      "effective_date": "3/07/2025",
      "sections": [
        {
          "title": "1. General",
          "content": "La aplicación está diseñada para personas que se preparan para los exámenes de CDL en los Estados Unidos. Se proporciona tal cual, sin garantías. Usted acepta usar la aplicación solo con fines legales y en conformidad con todas las leyes aplicables."
        },
        {
          "title": "2. Pagos y suscripciones",
          "content": "Algunas funciones están disponibles solo mediante suscripción. Las suscripciones pueden ser semanales, mensuales, trimestrales, semestrales o anuales. Los pagos se procesan a través de Google Play o Apple App Store, según el dispositivo. Las suscripciones se renuevan automáticamente a menos que se cancelen al menos 24 horas antes del final del período actual. Puede gestionar o cancelar su suscripción desde los ajustes de su cuenta."
        },
        {
          "title": "3. Uso del contenido",
          "content": "Todo el contenido dentro de la aplicación, incluidas preguntas, traducciones, ilustraciones y explicaciones, es solo para fines educativos. No puede copiar, reproducir, distribuir ni vender ningún contenido sin autorización por escrito."
        },
        {
          "title": "4. Renuncia de responsabilidad",
          "content": "CDL Pro se ofrece únicamente con fines educativos. No nos responsabilizamos del resultado de su examen ni de la imposibilidad de obtener un permiso CDL. CDL Pro ofrece exámenes de práctica y materiales de estudio para ayudarle a prepararse, pero aprobar el examen depende en última instancia de su esfuerzo y comprensión del material. Siempre verifique la información con fuentes oficiales y consulte con su DMV local para conocer los requisitos más actualizados. Utilice CDL Pro como herramienta complementaria junto con la capacitación adecuada y las guías de estudio oficiales."
        },
        {
          "title": "5. Privacidad",
          "content": "Respetamos su privacidad. Consulte nuestra Política de Privacidad para obtener más detalles sobre cómo protegemos su información."
        },
        {
          "title": "6. Modificaciones",
          "content": "Nos reservamos el derecho de modificar estos Términos en cualquier momento. El uso continuo de la aplicación constituye la aceptación de los términos actualizados."
        },
        {
          "title": "7. Contacto",
          "content": "Si tiene preguntas, contáctenos en: ulamuyaman@gmail.com"
        }
      ]
    }
  }
}
