{
  "en": {
    "effective_date": "2025-06-29",
    "title": "Privacy Policy for CDL Pro",
    "sections": [
      {
        "title": "1. Personal Information We Collect",
        "content": "CDL Pro does not collect any personal data beyond what is necessary for user authentication. Users can sign in using one of the following methods:\n\n- Email and password\n- Google account\n- Apple ID"
      },
      {
        "title": "2. Purpose of Authentication",
        "content": "We use authentication strictly for the following reasons:\n\n- Save Progress: To allow users to continue the quiz from where they left off, across devices or sessions.\n- User Feedback: To enable users to report errors or suggest improvements to the quiz content."
      },
      {
        "title": "3. Data Sharing",
        "content": "We do not share, sell, or rent your personal information to any third parties. All user data is securely stored and handled in accordance with standard industry practices."
      },
      {
        "title": "4. Account Deletion and Sign-Out",
        "content": "Users can delete their account at any time. Alternatively, they may sign out from the app. Account deletion will permanently remove all associated user data, including saved progress."
      },
      {
        "title": "5. Children's Privacy",
        "content": "CDL Pro is not intended for use by children under the age of 13. We do not knowingly collect data from children."
      },
      {
        "title": "6. Changes to This Policy",
        "content": "We may update this Privacy Policy from time to time. Continued use of the app after any changes constitutes acceptance of the new policy."
      },
      {
        "title": "7. In-App Purchases and Subscriptions",
        "content": "CDL Pro offers optional in-app subscriptions that provide access to premium content. Payments are processed securely through Google Play. We do not collect or store payment information."
      },
      {
        "title": "Contact Us",
        "content": "Email: Ulamuyaman@gmail.com\nApp Settings: Use the \"Report a Problem\" feature in the app."
      }
    ]
  },
  "ru": {
    "effective_date": "2025-06-29",
    "title": "Политика конфиденциальности CDL Pro",
    "sections": [
      {
        "title": "1. Личная информация, которую мы собираем",
        "content": "CDL Pro не собирает личные данные, за исключением необходимых для аутентификации. Вы можете войти в приложение через:\n\n- Электронную почту и пароль\n- Аккаунт Google\n- Apple ID"
      },
      {
        "title": "2. Цель аутентификации",
        "content": "Аутентификация используется исключительно для:\n\n- Сохранения прогресса: чтобы вы могли продолжить с того места, где остановились\n- Обратной связи: чтобы сообщать об ошибках и предлагать улучшения"
      },
      {
        "title": "3. Передача данных",
        "content": "Мы не передаём, не продаём и не сдаём в аренду ваши личные данные третьим лицам. Все данные надёжно хранятся и обрабатываются в соответствии со стандартами отрасли."
      },
      {
        "title": "4. Удаление аккаунта и выход",
        "content": "Вы можете удалить аккаунт в любое время. Также можно просто выйти из приложения. Удаление приведёт к безвозвратному удалению всех данных, включая прогресс."
      },
      {
        "title": "5. Конфиденциальность детей",
        "content": "Приложение не предназначено для детей младше 13 лет. Мы не собираем данные о детях."
      },
      {
        "title": "6. Изменения в политике",
        "content": "Мы можем вносить изменения в политику конфиденциальности. Использование приложения после обновлений означает согласие с новой версией."
      },
      {
        "title": "7. Подписки и покупки",
        "content": "CDL Pro предлагает подписки для доступа к премиум-контенту. Платежи обрабатываются через Google Play. Мы не храним платёжные данные."
      },
      {
        "title": "Связь с нами",
        "content": "Email: Ulamuyaman@gmail.com\nВ настройках: используйте функцию \"Сообщить о проблеме\"."
      }
    ]
  },
  "uk": {
    "effective_date": "2025-06-29",
    "title": "Політика конфіденційності CDL Pro",
    "sections": [
      {
        "title": "1. Особиста інформація, яку ми збираємо",
        "content": "CDL Pro не збирає жодної особистої інформації, окрім тієї, що необхідна для автентифікації. Ви можете увійти через:\n\n- Email та пароль\n- Обліковий запис Google\n- Apple ID"
      },
      {
        "title": "2. Мета автентифікації",
        "content": "Ми використовуємо автентифікацію виключно для:\n\n- Збереження прогресу\n- Надання зворотного зв’язку для покращення контенту"
      },
      {
        "title": "3. Передача даних",
        "content": "Ми не передаємо, не продаємо та не здаємо в оренду вашу інформацію третім сторонам. Дані зберігаються відповідно до стандартів галузі."
      },
      {
        "title": "4. Видалення облікового запису",
        "content": "Користувач може видалити акаунт у будь-який момент. Видалення видаляє всі дані безповоротно."
      },
      {
        "title": "5. Конфіденційність дітей",
        "content": "Програма не призначена для дітей до 13 років. Ми не збираємо дані про дітей."
      },
      {
        "title": "6. Зміни до політики",
        "content": "Ми можемо змінювати політику конфіденційності. Подальше використання означає згоду з новими умовами."
      },
      {
        "title": "7. Покупки в додатку",
        "content": "Додаток має підписки на преміум-контент. Платежі здійснюються через Google Play. Ми не зберігаємо платіжні дані."
      },
      {
        "title": "Зв’язок з нами",
        "content": "Email: Ulamuyaman@gmail.com\nУ налаштуваннях: скористайтеся \"Повідомити про проблему\"."
      }
    ]
  },
  "es": {
    "effective_date": "2025-06-29",
    "title": "Política de privacidad de CDL Pro",
    "sections": [
      {
        "title": "1. Información personal que recopilamos",
        "content": "CDL Pro no recopila datos personales excepto los necesarios para la autenticación. Puede iniciar sesión mediante:\n\n- Correo electrónico y contraseña\n- Cuenta de Google\n- Apple ID"
      },
      {
        "title": "2. Propósito de la autenticación",
        "content": "Usamos la autenticación solo para:\n\n- Guardar el progreso\n- Permitir comentarios para mejorar el contenido"
      },
      {
        "title": "3. Compartición de datos",
        "content": "No compartimos, vendemos ni alquilamos sus datos a terceros. Toda la información se almacena de forma segura."
      },
      {
        "title": "4. Eliminación de cuenta",
        "content": "Puede eliminar su cuenta en cualquier momento. Esto borrará permanentemente todos sus datos, incluido el progreso."
      },
      {
        "title": "5. Privacidad infantil",
        "content": "CDL Pro no está destinado a menores de 13 años. No recopilamos datos de niños."
      },
      {
        "title": "6. Cambios en esta política",
        "content": "Podemos actualizar esta política ocasionalmente. El uso continuo de la app implica aceptación."
      },
      {
        "title": "7. Compras y suscripciones",
        "content": "CDL Pro ofrece suscripciones para contenido premium. Los pagos se procesan a través de Google Play. No almacenamos información de pago."
      },
      {
        "title": "Contáctanos",
        "content": "Correo: Ulamuyaman@gmail.com\nEn la app: Use la función \"Reportar un problema\"."
      }
    ]
  }
}
